<template>
  <div class="w-full mx-auto flex flex-col scroll-none">
    <HeaderNav />

    <main class="p-8">
      <h2 class="my-8">
        <span class="hidden lg:block text-4xl font-bold">
          {{ $t('利用規約') }}
        </span>
        <span class="block lg:hidden text-4xl font-bold">
          {{ $t('利用規約') }}
        </span>
      </h2>
      <div class="p-8 text-lg rounded-lg bg-white">
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第1条 （適用）</h3>
          <p>
            1.
            Reshelf利用規約（以下、「本規約」といいます。）は、合同会社Reshelf（以下、「当社」といいます。）が提供するインターネットサイト「Reshelf」により表示されるサイトを指し、以下、「本サイト」といいます。）において当社が提供するプログラミング教材のマーケットプレイスサービス（以下、「本サービス」といいます。）を利用する個人及び法人と当社との権利義務関係を定めるものです。
            2.
            本サービスを利用する個人及び法人は、本サービスの利用により、本規約が適用されることについて予め同意し利用しているものとみなします。なお、未成年者の利用には保護者の方による事前の承諾を得ていることが前提となります。
            3.
            当社が本サイト上で掲載する本サービスに関するルール等も本規約の一部を構成するものとします。
            4.
            本規約の内容と、前項のルール等が異なる場合は、本規約の規定が優先するものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第2条 （定義）</h3>
          <p>
            本規約において各用語の定義は以下に定めるものとします。
            (1)「サービス利用契約」とは、当社と本サービスを利用する個人及び法人との間の本規約に基づく本サービスの利用契約を意味します。
            (2)「講師」とは、第3条の定めに従い登録を完了し、本サイトにおいてプログラミング教材に関する内容等（以下、「プログラミング教材」といい、第５号で定義します。）を掲載しプログラミング教材の利用を希望する生徒を募集する個人又は法人をいいます。
            (3)「生徒」とは、本サイトにおいて講師との間でプログラミング教材の利用に関する契約の締結を希望する個人又は法人をいいます。
            (4)「取引」とはプログラミング教材の利用を目的とする講師と生徒間の契約を言うものとします。
            (5)「プログラミング教材」とは講師が作成するプログラミング技術の習得のための一連の教材をいいます。講師は本サイト上で経歴やスキルなどの概要を記載し、またプログラミング教材の内容を記載した情報を掲載し、生徒からの利用申込みを募集します。
            (6)「知的財産権等」とは、著作権（著作権法第27条及び第28条に定める権利を含む。）、特許権、実用新案権、商標権、意匠権その他の知的財産権（それらの権利を取得し、又はそれらの権利につき登録等を出願する権利を含む。）及びノウハウを意味します。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第3条 （利用登録 ）</h3>
          <p>
            1.
            講師としてプログラミング教材を本サイト上に掲載し生徒からの利用申込みの募集を希望する者及び生徒としてプログラミング教材の利用を希望する者は、本規約を遵守することに同意し、かつ当社の定める一定の情報を当社の定める方法で提供することにより、当社に対し、本サービスの利用の登録を申請することができます。なお、未成年者の利用登録には保護者の方による事前の承諾を得ていることが前提となります。
            2.
            当社は、前項に基づいて登録申請を行った登録希望者（以下、「登録申請者」といいます。）の登録の可否を判断し、当社が登録を認める場合にはその旨を登録申請者に通知し、当該通知により登録が完了したものとします。
            3.
            当社は、登録申請者が、以下の各号のいずれかの事由に該当する場合登録を拒否することがあり、又その理由につき一切開示する義務を負わないものとします。
            (1)当社に提供した登録事項の全部又は一部につき虚偽、誤記又は記載漏れがあった場合
            (2)未成年者、成年被後見人、被保佐人又は被補助人のいずれかであり、法定代理人、後見人、保佐人又は補助人の同意等を得ていなかった場合
            (3)反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、その他これに準じる者を意味します。）である、又は反社会的勢力等を利用もしくは反社会的勢力等に資金提供や便宜の供与を行う等の反社会的勢力等と社会的に許容されない関係を有すると当社が判断した場合
            (4)登録申請者が過去当社と何らかの契約に違反した者又はその関係者であると当社が判断した場合
            (5)登録申請者が過去当社により本サービスの登録を抹消されたことがある場合
            (6)その他、当社が登録を適当でないと判断した場合 4.
            本条第2項の登録の完了時に、当社と登録申請者間でサービス利用契約が成立します。登録の完了後、登録申請者は講師又は生徒として、本サイト上での掲載等の本サービスを利用できるものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第4条 （登録事項の変更）</h3>
          <ul class="list-disc pl-8">
            <p>
              講師及び生徒は、登録事項に変更があった場合、当社の定める方法により当該変更事項を遅滞なく当社に通知するものとします。
            </p>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第5条 （禁止事項）</h3>
          <ul class="list-disc pl-8">
            <p>
              講師及び生徒は、本サービスの利用にあたり、以下の各号に該当する行為又は該当すると当社が判断する行為を行うことを禁止します。
              (1)法令に違反する行為又は犯罪行為に関連する行為
              (2)当社、本サービスの講師又は生徒もしくはその他の第三者に対する詐欺又は脅迫行為
              (3)公序良俗に反する行為
              (4)当社、本サービスの講師又は生徒もしくはその他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利又は利益を侵害する行為
              (7)本サービスにおいてプログラミング教材の利用申込みを募集する際において消費者契約法、特定商取引法等関連する法律に反する広告、表示、契約条件を掲載し募集する行為
              (8)当社の本サービスを通さず、講師と生徒間で直接取引を行う行為。
              (9)本サービスのネットワーク又はシステム等に過度な負荷をかける行為
              (10)本サービスの運営を妨害するおそれのある行為
              (11)当社のネットワーク又はシステム等に不正にアクセスし、又は不正なアクセスを試みる行為
              (12)第三者に成りすます行為
              (13)当社が許諾していない本サービス上での宣伝、広告、勧誘、又は営業行為
              (14)本サービスの他の講師又は生徒もしくはその他の第三者に不利益、損害、不快感を与える行為
              (15)当社の本サービスを利用し作成したプログラムをそのままインターネット上で公開し自己のサービスとして提供する行為。
              (16)反社会的勢力等への利益供与
              (17)面識のない異性との出会いを目的とした行為
              (18)その他、当社が不適切と判断する行為
            </p>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第6条 （本サービスの停止又は中断）
          </h3>
          <p>
            1.
            当社は、以下のいずれかに該当する場合には、講師及び生徒に事前に通知することなく、本サービスの全部又は一部の停止又は中断することができるものとします。
            (1)本サービスに係るコンピューターシステム・ソフトウェアの点検又は保守作業を緊急に行う場合
            (2)本サービスに係るコンピューターシステム・ソフトウェア、通信回線が事故により停止した場合
            (3)地震、火災、停電、戦争、暴動、その他合理的支配の及ばない不可抗力により本サービスの運営ができなくなった場合
            (4)その他、当社が停止又は中断を必要と判断した場合 2.
            当社は、本条に基づき本サービスの停止を行ったことにより講師又は生徒に生じた損害又は損失について一切の責任を免れるものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第7条 （権利帰属）</h3>
          <p>
            1.
            本サービスに関する知的財産権等は全て当社又は当社にライセンスを許諾している者に帰属しており、本規約に基づく本サービス利用の許諾は当該知的財産権等の利用許諾を意味するものでないことを予め講師及び生徒は同意するものとします。
            2.
            講師及び生徒は本サービスにおいて掲載する情報、コメント等について、自らが投稿その他送信することについての適法な権利を有していること、及び掲載する情報が第三者の権利を侵害していないことを当社に対して表明し、保証するものとします。
            3.
            講師及び生徒は、掲載する情報の知的財産権等について、当社に対し、非独占的、無償、サブライセンス可能かつ譲渡可能な使用、複製、配布、派生著作物の作成、表示及び実行に関するライセンスを付与するものとします。
            4.
            講師及び生徒は、本サービスに掲載する情報を当社が広告目的で他社メディアへの掲載のために利用（複製、配布、派生著作物の作成等を含むがこれに限らないものとします。）することを許諾するものとします。
            5.
            講師及び生徒は、当社及び当社から権利を承継し又は許諾された者に対して著作者人格権を行使しないことに予め同意するものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第8条 （利用停止、登録抹消、利用契約解除）
          </h3>
          <p>
            1.
            当社は、講師又は生徒が、以下の各号のいずれかに該当する又は当社が該当すると判断した場合は、事前に通知又は催告することなく、講師又は生徒について本サービスの利用を一時的に停止し、又は登録の抹消もしくはサービス利用契約を解除することができます。
            (1)本規約のいずれかの条項に違反した場合
            (2)登録事項に虚偽の事実があることが判明した場合
            (3)支払い停止もしくは支払不能となり、又は破産手続開始、民事再生手続開始、会社更生手続開始、特別清算開始もしくはこれらの手続の開始の申立てがあった場合
            (4)6ヵ月以上本サービスの利用がない場合
            (5)当社からの問い合わせその他の回答を求める連絡に対して7日間応答がない場合
            (6)第3条第3項各号に該当する場合
            (7)その他、当社が本サービスの利用、講師としての登録又はサービス利用契約の継続を適当でないと判断した場合
            2.
            前項各号のいずれかの事由に該当した場合、講師又は生徒は、当社に対して負っている債務があるときは、その一切について当然に期限の利益を失い、直ちに当社に対して全ての債務の支払いを行わなければなりません。
            3.
            当社は、本条に基づき当社が行った行為により講師又は生徒に生じた損害又は損失について一切の責任を負いません。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第9条 （退会）</h3>
          <p>
            1.
            講師及び生徒は、当社所定の方法に従い本サービスから退会、登録の抹消等をすることができます。
            2.
            退会時の債務が残存する場合、講師及び生徒は残存する債務の一切について期限の利益を失い、直ちに当社に対して全ての債務の支払を行わなければなりません。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第10条 （本サービスの内容の変更、終了等）
          </h3>
          <p>
            1.
            当社は、当社の都合により、本サービスの内容を変更し、又は提供を終了することができるものとします。当社が本サービスの提供を終了する場合、当社は講師及び生徒に1ヵ月前までに通知するものとします。
            2.
            当社は、本条に基づき当社が行った措置に基づき講師及び生徒に生じた損害につき一切の責任を負わないものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第11条 （登録情報・掲載情報の削除）
          </h3>
          <p>
            サービス利用契約が理由の如何を問わず終了した場合、当社は講師又は生徒の登録情報及び本サービスに掲載した情報を速やかに削除するものとします。ただし、講師及び生徒は、本サービスに掲載された情報が本サービス以外の外部メディアでの広告等で掲載された場合、当該情報は削除されない場合があることを予め承諾するものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第12条 （免責・責任制限）</h3>
          <p>
            1.
            当社は、本サービスの提供に関して、以下各号に規定する場合をはじめ、いかなる場合でも、講師又は生徒が被った一切の損害について賠償する責任を負わないものとします。
            (1)インターネット接続サービスの不具合等接続環境に障害が生じたこと、又はそのおそれが生じたこと
            (2)電気通信事業者等の提供する電気通信サービスに不具合が生じたこと、又はそのおそれが生じたこと
            (3)上記各号のほか、自らの合理的な支配の及ばない状況（火事、停電、ハッキング、コンピューターウイルスの侵入、地震、洪水、戦争、通商停止、ストライキ、暴動、物資及び輸送施設の確保不能、本サーバの設置場所における第三者による本サーバへの加害事故の発生、又は政府当局による介入を含みますがこれに限りません。）により本サービス提供の履行が遅滞、中断、中止が生じたこと、又はそのおそれが生じたこと
            2.
            当社は、本サービスにより講師の提供するプログラミング教材のマーケットプレイスを提供するものであり、講師と生徒間の取引に関する契約の当事者になるものではありません。当該取引に関する契約に関して当事者間で生じた紛争について当社は一切の責任を負わないものとします。
            3.
            当社は、本サービスに関して講師と生徒間又は講師もしくは生徒と第三者の間で生じた一切のトラブルについて、何等の責任を負わないものとします。当該トラブルについては当事者間で解決しなければならないものとします。
            4.
            当社は、講師が提供する情報又は助言が真実性、最新性、確実性、有用性等を有すること、講師の企画するプログラミング教材が適用のある法令又は業界団体の内部規則等に適合することについて何ら保証するものではありません。
            5.
            当社は、当社による本サービスの提供の中断、停止、終了、利用不能、又は変更、講師又は生徒の通知の削除又は消失、本サービスの利用によるデータの消失又は機器の故障もしくは損傷、その他本サービスに関して講師及び生徒が被った損害につき、賠償する責任を一切負わないものとします。
            6.
            前各項に関わらず、当社が責任を負う場合であっても、当社は講師又は生徒が被った損害について、過去６ヶ月間に講師又は生徒が当社に支払った本サービスの対価の総額を超えて賠償する責任を負わないものとし、又、付随的損害、間接損害、特別損害、将来の損害及び逸失利益に係る損害については、賠償する責任を負わないものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第13条 （秘密保持）</h3>
          <p>
            講師及び生徒は、本サービスに関連して当社が秘密に取り扱うことを求めて開示した非公知の情報について、当社の書面の承諾がある場合を除き、秘密に取り扱うものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第14条 （個人情報保護）</h3>
          <p>
            1.当社は、本サービスの提供に関連して講師あるいは生徒の個人情報等を取り扱う場合、個人情報保護法及びその他ガイドラインに則り、当該情報を取り扱うものとします。
            2.当社は、本サービスを提供するに当たり、当社が了知した個人情報等について、以下各号に定める目的で利用するものとし、講師あるいは生徒は予めこの点について了承するものとします。
            (1)本サービスを提供し、講師や生徒を管理するために必要な場合（本人確認等をする場合を含みます。）
            (2)当社各種サービスのご案内等(ダイレクトメールの送付、電子メールの送信を含みます。)を行う場合
            (3)本規約や法律等に基づく権利の行使や義務の履行の場合
            (4)本サービスの品質管理・品質向上のために行うマーケティング調査及び分析に利用する場合
            (5)本サービスの各種問い合せに対応する場合やアフターサービスを行う場合
            (6)本サービスの提供に関する事柄についての連絡、追加サービス等の情報提供を行う場合
            (7)本サービスにおけるシステムの維持、不具合対応を行う場合
            (8)その他、当社が講師あるいは生徒に事前連絡の上、個別に了承をいただいた目的に利用する場合
            3.当社は、講師あるいは生徒の個人情報等を、以下のいずれかの事由に該当する場合を除き、本人以外の第三者に開示しないものとし、かつ本サービスを提供していく上で必要な範囲を超えて利用しないものとします。
            (1) 講師あるいは生徒の同意が得られた場合
            (2)本サービスに関して、当社の権利行使に必要な場合
            (3)合併、営業譲渡その他の事由による事業の承継の際に事業を承継する者に対して開示する場合
            (4)個人情報保護法その他の法令により認められた場合
            (5)官公庁等の公的機関から法令に基づき開示を求められた場合 4.
            講師及び生徒は、当社が本条第2項及び3項に定める目的で個人情報等を収集・利用することについて、予め了承するものとします。
            5講師及び生徒は、本サービスに関連して当社に提供した個人情報等について、開示、削除、訂正または利用停止の請求ができるものとし、本人からの請求であることが確認できる場合に限り、当社はこれに速やかに対応するものとします。
            当社の本件問合せ窓口は以下の通りとします。 合同会社Reshelf運営事務局
            電話番号：050-6861-7288 メールアドレス：support @reshelf.jp 6.
            当社は、講師及び生徒の提供した情報について、個人を特定できない形で統計的な情報として加工し、当社の裁量において利用することができるものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第15条 （本規約の変更）</h3>
          <p>
            当社は、本規約を変更できるものとします｡当社は、本規約を変更した場合には、変更後の本規約を本サイト上に表示し、当該表示後７日間の経過をもってその効力が生じるものとします。なお、講師又は生徒は当該期間経過後の本サービスの利用により当該変更に同意したものとみなされます。
          </p>
        </div>
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第16条 （通知）</h3>
          <p>
            本サービスに関する問い合わせその他講師及び生徒から当社に対する連絡又は通知、及び本規約の変更に関する通知その他当社から講師及び生徒に対する連絡又は通知は、本サイト上に掲示する方法又は電子メールにより行うものとします。
          </p>
        </div>
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第17条 （地位の譲渡）</h3>
          <p>
            1.
            講師及び生徒は、当社の書面による承諾を得た場合を除き、サービス利用契約上の地位又は本規約に基づく権利もしくは義務につき、第三者に対し譲渡、移転、担保設定、その他の処分をすることはできません。
            2.
            当社は本サービスにかかる事業を他社に譲渡、会社分割により譲渡（以下、「事業譲渡等」といいます。）を行った場合には、サービス利用契約上の地位、本規約に基づく権利及び義務並びに講師及び生徒の情報その他の顧客情報を事業譲渡等に伴い他社に譲渡することができるものとします。講師及び生徒はかかる譲渡につき予め同意するものとします。
          </p>
        </div>
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第18条 （分離可能性）</h3>
          <p>
            本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、当該無効又は執行不能と判断された条項を除く残りの条項は、継続して完全に効力を有するものとします。
          </p>
        </div>
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第19条 （準拠法及び管轄裁判所）
          </h3>
          <p>
            1. 本規約及びサービス利用契約の準拠法は日本法とします。 2.
            本規約又はサービス利用契約に起因し、又は関連する一切の紛争については、東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とします。
            【特則】 講師向け個別規定 1. プログラミング教材の本サイトへの掲載
            講師は、プログラミング教材の詳細（習得されるスキル、プログラミング教材内容の概要等）を本サイト上に掲載し生徒からのプログラミング教材の利用申込みを募集するものとします。
            2. プログラミング教材の購入の承諾
            講師は、本サイトに掲載されたプログラミング教材に対する生徒からの購入の申込み後速やかに承諾の可否を検討し、生徒及び当社に承諾の可否を通知しなければならないものとします。当該承諾の通知が生徒に到達した時点で取引が成立するものとします。
            3. プログラミング教材の対価の受取
            取引が成立後、本サイトに掲載された支払期日までに生徒からの対価を当社が講師に代わり受領するものとします。当社は、当月のプログラミング教材の対価（キャンセルの場合キャンセル料）を当月末で締め翌月末までに、別途本サイト上で定められた本サービス利用料を控除した金額を講師に支払うものとします。
            4. キャンセル料受取の例外条件
            講師は参加申込を受けた生徒からのプログラミング教材について、当該生徒の責に帰することのできない不可抗力等の事由（当該事由の存否については客観的事由に基づいて当社が合理的に判断するものとします。）に基づいて申込受領済プログラミング教材のキャンセルの申し出を受けた場合には、キャンセル期間を渡過した場合であってもこれに応じるものとし、講師は当該対応について予め了承するものとします。
            ５．返金対応
            前項又は前々項において、キャンセル等により返金が発生し、講師に代わり当社から生徒に対しての支払いを行う場合、当社は、生徒から指定があり、かつ生徒に対する返金を行う口座として適切であると当社が認めた口座（以下、「生徒指定口座」といいます。）に対して返金を行うものとします（返金に要する手数料は生徒の負担とします。）。
            ６．プログラミング教材の独占掲載
            講師は本サイトに掲載したプログラミング教材については、掲載時から2年間、当社が本サイト上において独占的に掲載をすることを許諾するものとします。講師は、当該プログラミング教材について掲載時から2年間の期間中は、本サイトを介することなく、当社以外の第三者のサービスにおいて当該本サイトに掲載したプログラミング教材と同内容のプログラミング教材を掲載又は利用申込みの募集を行わないものとします。
          </p>
        </div>
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">生徒向け個別規定</h3>
          <p>
            1. プログラミング教材の予約、取引の成立
            講師によるプログラミング教材の利用を希望する生徒は、本サイトにおいて掲載されたプログラミング教材の詳細を確認の上、本サイトにおいて予約申込みを行うものとします。当該予約の申込みが講師により承諾されることにより生徒と講師間で取引が成立します。
            2. プログラミング教材の対価の支払
            生徒と講師間で取引が成立した場合、生徒は本サイトに掲載された支払期日までに別途本サイトに定められた方法（銀行振込、カード決済等）に従い当社にプログラミング教材の対価を支払うものとします。なお支払いにかかる手数料は生徒が負担するものとします。
            3. キャンセルについて
            取引成立後に、取引のキャンセルを行う場合、本サイトに掲載されたキャンセルポリシーが適用され、キャンセル料などが発生することを生徒は予め承諾するものとします。キャンセル手続きが完了後キャンセル料を差し引いた金額を生徒に速やかに返還するものとします。なお返還に伴う振込手数料は生徒が負担するものとします。
            4. 連絡
            生徒は、本サービスにおいて、本規約に違反するプログラミング教材が掲載されていることを発見した場合、速やかに当社に連絡するものとします。
          </p>
        </div>
        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">附則</h3>
          <p>2022年2月5日制定</p>
        </div>
      </div>
    </main>

    <FooterNav />
  </div>
</template>
<script>
export default {
  head: {
    title: '利用規約 | Reshelf',
    meta: [
      {
        hid: '利用規約',
        name: '利用規約',
        content:
          'Reshelfの利用規約ページです。個人情報の取扱いについて掲載しています。',
      },
    ],
  },
}
</script>
<style lang="scss" scoped>
main {
  @apply w-full h-full mx-auto flex flex-col items-center;
  max-width: 1000px;
}
ul {
  li,
  ul li,
  ul ul li {
    @apply my-2;
  }
}
</style>
